<?php

namespace App\Enum;

enum ExpenseType: string
{
    // Орон сууц
    case Түрээс_Ипотекийн_Зээл = 'Түрээс/Ипотекийн зээл';
    case Үл_хөдлөх_хөрөнгийн_татвар = 'Үл хөдлөх хөрөнгийн татвар';
    case Гэрийн_даатгал = 'Гэрийн даатгал';

    // Гэрийн хэрэглээ
    case Цахилгаан = 'Цахилгаан';
    case Ус = 'Ус';
    case Хий = 'Хий';
    case Интернет_Утас = 'Интернет/Утас';

    // Тээвэр
    case Машины_зээл = 'Машины зээл';
    case Шатахуун = 'Шатахуун';
    case Нийтийн_тээвэр = 'Нийтийн тээвэр';
    case Машины_даатгал = 'Машины даатгал';

    // Хүнс
    case Хүнсний_бүтээгдэхүүн = 'Хүнсний бүтээгдэхүүн';
    case Гадуур_хооллох = 'Гадуур хооллох';

    // Эрүүл мэнд
    case Эрүүл_мэндийн_даатгал = 'Эрүүл мэндийн даатгал';
    case Эмчид_үзүүлэх = 'Эмчид үзүүлэх';
    case Эмийн_жор = 'Эмийн жор';

    // Хувийн арчилгаа
    case Үсний_засалт_Гоёл = 'Үсний засалт/Гоёл';
    case Ариун_цэврийн_хэрэгсэл = 'Ариун цэврийн хэрэгсэл';

    // Өр төлбөр
    case Оюутны_зээл = 'Оюутны зээл';
    case Кредит_картын_төлбөр = 'Кредит картын төлбөр';

    // Үзвэр үйлчилгээ
    case Стрийминг_үйлчилгээ = 'Стрийминг үйлчилгээ';
    case Хобби = 'Хобби';

    // Хувцас
    case Хувцас_гутал = 'Хувцас, гутал';

    // Хуримтлал
    case Яаралтай_тусламжийн_сан = 'Яаралтай тусламжийн сан';
    case Тэтгэврийн_хуримтлал = 'Тэтгэврийн хуримтлал';
}
